Kinin-Code-Offical/robotwin-studio/NativeEngine/src/MCU/ATmega328P_ISA.c
#include "MCU/ATmega328P_ISA.h"

uint8_t AVR_IoRead(AvrCore* core, uint16_t address);
void AVR_IoWrite(AvrCore* core, uint16_t address, uint8_t value);
static void AVR_Push(AvrCore* core, uint8_t value);

static uint16_t AVR_FetchWord(AvrCore* core)
{
    size_t index = (size_t)core->pc * 2;
    if (index + 1 >= core->flash_size)
    {
        return 0x0000;
    }
    uint16_t opcode = (uint16_t)(core->flash[index] | (core->flash[index + 1] << 8));
    core->pc++;
    return opcode;
}

static void AVR_UpdateSPRegisters(AvrCore* core)
{
    uint8_t spl = (uint8_t)(core->sp & 0xFF);
    uint8_t sph = (uint8_t)((core->sp >> 8) & 0xFF);
    AVR_IoWrite(core, AVR_SPL, spl);
    AVR_IoWrite(core, AVR_SPH, sph);
}

static void AVR_SetSP(AvrCore* core, uint16_t value)
{
    core->sp = value;
    AVR_UpdateSPRegisters(core);
}

static uint16_t AVR_GetSP(AvrCore* core)
{
    return core->sp;
}

static uint8_t AVR_ReadData(AvrCore* core, uint16_t address)
{
    if (address < core->regs_size)
    {
        return core->regs[address];
    }
    if (address >= AVR_IO_BASE && address < (AVR_IO_BASE + core->io_size))
    {
        size_t idx = (size_t)(address - AVR_IO_BASE);
        return core->io[idx];
    }
    if (address >= AVR_SRAM_START)
    {
        size_t idx = (size_t)(address - AVR_SRAM_START);
        if (idx < core->sram_size)
        {
            return core->sram[idx];
        }
    }
    return 0;
}

static void AVR_WriteData(AvrCore* core, uint16_t address, uint8_t value)
{
    if (address < core->regs_size)
    {
        core->regs[address] = value;
        return;
    }
    if (address >= AVR_IO_BASE && address < (AVR_IO_BASE + core->io_size))
    {
        AVR_IoWrite(core, address, value);
        return;
    }
    if (address >= AVR_SRAM_START)
    {
        size_t idx = (size_t)(address - AVR_SRAM_START);
        if (idx < core->sram_size)
        {
            core->sram[idx] = value;
        }
    }
}

static void AVR_Push(AvrCore* core, uint8_t value)
{
    uint16_t sp = AVR_GetSP(core);
    if (sp > 0)
    {
        sp--;
        AVR_WriteData(core, sp, value);
        AVR_SetSP(core, sp);
    }
}

static uint8_t AVR_Pop(AvrCore* core)
{
    uint16_t sp = AVR_GetSP(core);
    uint8_t value = AVR_ReadData(core, sp);
    sp++;
    AVR_SetSP(core, sp);
    return value;
}

static uint16_t AVR_GetRegWord(AvrCore* core, uint8_t index)
{
    if (index + 1 >= core->regs_size)
    {
        return 0;
    }
    uint8_t lo = core->regs[index];
    uint8_t hi = core->regs[index + 1];
    return (uint16_t)(lo | (hi << 8));
}

static void AVR_SetRegWord(AvrCore* core, uint8_t index, uint16_t value)
{
    if (index + 1 >= core->regs_size)
    {
        return;
    }
    core->regs[index] = (uint8_t)(value & 0xFF);
    core->regs[index + 1] = (uint8_t)((value >> 8) & 0xFF);
}

void AVR_Init(AvrCore* core,
              uint8_t* flash, size_t flash_size,
              uint8_t* sram, size_t sram_size,
              volatile uint8_t* io, size_t io_size,
              uint8_t* regs, size_t regs_size)
{
    core->flash = flash;
    core->flash_size = flash_size;
    core->sram = sram;
    core->sram_size = sram_size;
    core->io = io;
    core->io_size = io_size;
    core->regs = regs;
    core->regs_size = regs_size;
    core->pc = 0;
    core->zero_flag = 0;
    core->carry_flag = 0;
    core->sp = (uint16_t)(AVR_SRAM_START + (uint16_t)sram_size - 1);
    core->io_write_user = NULL;
    core->io_write_hook = NULL;
    core->io_read_user = NULL;
    core->io_read_hook = NULL;
    core->mcu_kind = AVR_MCU_328P;
    AVR_UpdateSPRegisters(core);
}

void AVR_SetMcuKind(AvrCore* core, uint8_t mcu_kind)
{
    if (!core) return;
    core->mcu_kind = mcu_kind;
}

void AVR_SetIoWriteHook(AvrCore* core, void (*hook)(AvrCore* core, uint16_t address, uint8_t value, void* user), void* user)
{
    if (!core) return;
    core->io_write_hook = hook;
    core->io_write_user = user;
}

void AVR_SetIoReadHook(AvrCore* core, void (*hook)(AvrCore* core, uint16_t address, uint8_t value, void* user), void* user)
{
    if (!core) return;
    core->io_read_hook = hook;
    core->io_read_user = user;
}

uint8_t AVR_IoRead(AvrCore* core, uint16_t address)
{
    size_t idx = (size_t)(address - AVR_IO_BASE);
    if (idx >= core->io_size) return 0;
    uint8_t value = core->io[idx];
    if (core->io_read_hook)
    {
        core->io_read_hook(core, address, value, core->io_read_user);
    }
    return value;
}

void AVR_IoWrite(AvrCore* core, uint16_t address, uint8_t value)
{
    size_t idx = (size_t)(address - AVR_IO_BASE);
    if (idx >= core->io_size) return;
    if (address == AVR_TIFR0 || address == AVR_TIFR1 || address == AVR_TIFR2 ||
        address == AVR_TIFR3 || address == AVR_TIFR4 || address == AVR_TIFR5 ||
        address == AVR_PCIFR || address == AVR_EIFR)
    {
        core->io[idx] = (uint8_t)(core->io[idx] & ~value);
        return;
    }
    if (address == AVR_ADCSRA)
    {
        uint8_t current = core->io[idx];
        uint8_t clearMask = (uint8_t)(value & (1u << 4));
        uint8_t next = (uint8_t)((current & ~clearMask) | (value & ~(1u << 4)));
        core->io[idx] = next;
        return;
    }
    core->io[idx] = value;
    if (address == AVR_SPL)
    {
        core->sp = (uint16_t)((core->sp & 0xFF00) | value);
    }
    else if (address == AVR_SPH)
    {
        core->sp = (uint16_t)((core->sp & 0x00FF) | ((uint16_t)value << 8));
    }
    if (core->io_write_hook)
    {
        core->io_write_hook(core, address, value, core->io_write_user);
    }
}

void AVR_IoSetBit(AvrCore* core, uint16_t address, uint8_t bit, uint8_t state)
{
    uint8_t value = AVR_IoRead(core, address);
    if (state)
    {
        value = (uint8_t)(value | (1u << bit));
    }
    else
    {
        value = (uint8_t)(value & ~(1u << bit));
    }
    AVR_IoWrite(core, address, value);
}

uint8_t AVR_IoGetBit(AvrCore* core, uint16_t address, uint8_t bit)
{
    uint8_t value = AVR_IoRead(core, address);
    return (uint8_t)((value & (1u << bit)) != 0u);
}

static void AVR_EnterInterrupt(AvrCore* core, uint16_t vector)
{
    uint16_t returnAddr = core->pc;
    AVR_Push(core, (uint8_t)(returnAddr & 0xFF));
    AVR_Push(core, (uint8_t)((returnAddr >> 8) & 0xFF));
    uint8_t sreg = AVR_IoRead(core, AVR_SREG);
    sreg = (uint8_t)(sreg & ~(1u << 7));
    AVR_IoWrite(core, AVR_SREG, sreg);
    core->pc = vector;
}

static uint8_t AVR_CheckInterrupts(AvrCore* core)
{
    uint8_t sreg = AVR_IoRead(core, AVR_SREG);
    if ((sreg & (1u << 7)) == 0)
    {
        return 0;
    }

