Kinin-Code-Offical/robotwin-studio/NativeEngine/src/MCU/ATmega328P_ISA.c
    uint16_t v_pcint0 = 0x0006;
    uint16_t v_pcint1 = 0x0008;
    uint16_t v_pcint2 = 0x000A;
    uint16_t v_wdt = 0x000C;
    uint16_t v_t2_compa = 0x000E;
    uint16_t v_t2_compb = 0x0010;
    uint16_t v_t2_ovf = 0x0012;
    uint16_t v_t1_compa = 0x0016;
    uint16_t v_t1_compb = 0x0018;
    uint16_t v_t1_ovf = 0x001A;
    uint16_t v_t0_compa = 0x001C;
    uint16_t v_t0_compb = 0x001E;
    uint16_t v_t0_ovf = 0x0020;
    uint16_t v_spi = 0x0022;
    uint16_t v_uart0_rx = 0x0024;
    uint16_t v_uart0_udre = 0x0026;
    uint16_t v_uart0_tx = 0x0028;
    uint16_t v_uart1_rx = 0x0036;
    uint16_t v_uart1_udre = 0x0038;
    uint16_t v_uart1_tx = 0x003A;
    uint16_t v_uart2_rx = 0x003C;
    uint16_t v_uart2_udre = 0x003E;
    uint16_t v_uart2_tx = 0x0040;
    uint16_t v_uart3_rx = 0x0042;
    uint16_t v_uart3_udre = 0x0044;
    uint16_t v_uart3_tx = 0x0046;
    uint16_t v_adc = 0x002A;
    uint16_t v_twi = 0x0030;

    if (core->mcu_kind == AVR_MCU_2560)
    {
        v_pcint0 = 0x0012;
        v_pcint1 = 0x0014;
        v_pcint2 = 0x0016;
        v_wdt = 0x0018;
        v_t2_compa = 0x001A;
        v_t2_compb = 0x001C;
        v_t2_ovf = 0x001E;
        v_t1_compa = 0x0022;
        v_t1_compb = 0x0024;
        v_t1_ovf = 0x0026;
        v_t0_compa = 0x0028;
        v_t0_compb = 0x002A;
        v_t0_ovf = 0x002C;
        v_spi = 0x002E;
        v_uart0_rx = 0x0030;
        v_uart0_udre = 0x0032;
        v_uart0_tx = 0x0034;
        v_uart1_rx = 0x0036;
        v_uart1_udre = 0x0038;
        v_uart1_tx = 0x003A;
        v_uart2_rx = 0x003C;
        v_uart2_udre = 0x003E;
        v_uart2_tx = 0x0040;
        v_uart3_rx = 0x0042;
        v_uart3_udre = 0x0044;
        v_uart3_tx = 0x0046;
        v_adc = 0x0048;
        v_twi = 0x004A;
    }

    uint8_t pcicr = AVR_IoRead(core, AVR_PCICR);
    uint8_t pcifr = AVR_IoRead(core, AVR_PCIFR);
    if ((pcicr & (1u << 0)) && (pcifr & (1u << 0)))
    {
        pcifr = (uint8_t)(pcifr & ~(1u << 0));
        AVR_IoWrite(core, AVR_PCIFR, pcifr);
        AVR_EnterInterrupt(core, v_pcint0);
        return 1;
    }
    if ((pcicr & (1u << 1)) && (pcifr & (1u << 1)))
    {
        pcifr = (uint8_t)(pcifr & ~(1u << 1));
        AVR_IoWrite(core, AVR_PCIFR, pcifr);
        AVR_EnterInterrupt(core, v_pcint1);
        return 1;
    }
    if ((pcicr & (1u << 2)) && (pcifr & (1u << 2)))
    {
        pcifr = (uint8_t)(pcifr & ~(1u << 2));
        AVR_IoWrite(core, AVR_PCIFR, pcifr);
        AVR_EnterInterrupt(core, v_pcint2);
        return 1;
    }

    uint8_t tifr2 = AVR_IoRead(core, AVR_TIFR2);
    uint8_t timsk2 = AVR_IoRead(core, AVR_TIMSK2);
    if ((tifr2 & (1u << 1)) && (timsk2 & (1u << 1)))
    {
        tifr2 = (uint8_t)(tifr2 & ~(1u << 1));
        AVR_IoWrite(core, AVR_TIFR2, tifr2);
        AVR_EnterInterrupt(core, v_t2_compa);
        return 1;
    }
    if ((tifr2 & (1u << 2)) && (timsk2 & (1u << 2)))
    {
        tifr2 = (uint8_t)(tifr2 & ~(1u << 2));
        AVR_IoWrite(core, AVR_TIFR2, tifr2);
        AVR_EnterInterrupt(core, v_t2_compb);
        return 1;
    }
    if ((tifr2 & (1u << 0)) && (timsk2 & (1u << 0)))
    {
        tifr2 = (uint8_t)(tifr2 & ~(1u << 0));
        AVR_IoWrite(core, AVR_TIFR2, tifr2);
        AVR_EnterInterrupt(core, v_t2_ovf);
        return 1;
    }

    uint8_t tifr1 = AVR_IoRead(core, AVR_TIFR1);
    uint8_t timsk1 = AVR_IoRead(core, AVR_TIMSK1);
    if ((tifr1 & (1u << 1)) && (timsk1 & (1u << 1)))
    {
        tifr1 = (uint8_t)(tifr1 & ~(1u << 1));
        AVR_IoWrite(core, AVR_TIFR1, tifr1);
        AVR_EnterInterrupt(core, v_t1_compa);
        return 1;
    }
    if ((tifr1 & (1u << 2)) && (timsk1 & (1u << 2)))
    {
        tifr1 = (uint8_t)(tifr1 & ~(1u << 2));
        AVR_IoWrite(core, AVR_TIFR1, tifr1);
        AVR_EnterInterrupt(core, v_t1_compb);
        return 1;
    }
    if ((tifr1 & (1u << 0)) && (timsk1 & (1u << 0)))
    {
        tifr1 = (uint8_t)(tifr1 & ~(1u << 0));
        AVR_IoWrite(core, AVR_TIFR1, tifr1);
        AVR_EnterInterrupt(core, v_t1_ovf);
        return 1;
    }

    uint8_t tifr0 = AVR_IoRead(core, AVR_TIFR0);
    uint8_t timsk0 = AVR_IoRead(core, AVR_TIMSK0);
    if ((tifr0 & (1u << 1)) && (timsk0 & (1u << 1)))
    {
        tifr0 = (uint8_t)(tifr0 & ~(1u << 1));
        AVR_IoWrite(core, AVR_TIFR0, tifr0);
        AVR_EnterInterrupt(core, v_t0_compa);
        return 1;
    }
    if ((tifr0 & (1u << 2)) && (timsk0 & (1u << 2)))
    {
        tifr0 = (uint8_t)(tifr0 & ~(1u << 2));
        AVR_IoWrite(core, AVR_TIFR0, tifr0);
        AVR_EnterInterrupt(core, v_t0_compb);
        return 1;
    }
    if ((tifr0 & (1u << 0)) && (timsk0 & (1u << 0)))
    {
        tifr0 = (uint8_t)(tifr0 & ~(1u << 0));
        AVR_IoWrite(core, AVR_TIFR0, tifr0);
        AVR_EnterInterrupt(core, v_t0_ovf);
        return 1;
    }

    uint8_t ucsr0a = AVR_IoRead(core, AVR_UCSR0A);
    uint8_t ucsr0b = AVR_IoRead(core, AVR_UCSR0B);
    if ((ucsr0a & (1u << 7)) && (ucsr0b & (1u << 7)))
    {
        AVR_EnterInterrupt(core, v_uart0_rx);
        return 1;
    }
    if ((ucsr0a & (1u << 5)) && (ucsr0b & (1u << 5)))
    {
        AVR_EnterInterrupt(core, v_uart0_udre);
        return 1;
    }
    if ((ucsr0a & (1u << 6)) && (ucsr0b & (1u << 6)))
    {
        ucsr0a = (uint8_t)(ucsr0a & ~(1u << 6));
        AVR_IoWrite(core, AVR_UCSR0A, ucsr0a);
        AVR_EnterInterrupt(core, v_uart0_tx);
        return 1;
    }

    if (core->mcu_kind == AVR_MCU_2560)
    {
        uint8_t ucsr1a = AVR_IoRead(core, AVR_UCSR1A);
        uint8_t ucsr1b = AVR_IoRead(core, AVR_UCSR1B);
        if ((ucsr1a & (1u << 7)) && (ucsr1b & (1u << 7)))
        {
            AVR_EnterInterrupt(core, v_uart1_rx);
            return 1;
        }
        if ((ucsr1a & (1u << 5)) && (ucsr1b & (1u << 5)))
        {
            AVR_EnterInterrupt(core, v_uart1_udre);
            return 1;
        }
        if ((ucsr1a & (1u << 6)) && (ucsr1b & (1u << 6)))
        {
            ucsr1a = (uint8_t)(ucsr1a & ~(1u << 6));
            AVR_IoWrite(core, AVR_UCSR1A, ucsr1a);
            AVR_EnterInterrupt(core, v_uart1_tx);
            return 1;
        }

        uint8_t ucsr2a = AVR_IoRead(core, AVR_UCSR2A);
        uint8_t ucsr2b = AVR_IoRead(core, AVR_UCSR2B);
        if ((ucsr2a & (1u << 7)) && (ucsr2b & (1u << 7)))
        {
            AVR_EnterInterrupt(core, v_uart2_rx);
            return 1;
        }
        if ((ucsr2a & (1u << 5)) && (ucsr2b & (1u << 5)))
        {
            AVR_EnterInterrupt(core, v_uart2_udre);
            return 1;
        }
        if ((ucsr2a & (1u << 6)) && (ucsr2b & (1u << 6)))
        {
            ucsr2a = (uint8_t)(ucsr2a & ~(1u << 6));
            AVR_IoWrite(core, AVR_UCSR2A, ucsr2a);
            AVR_EnterInterrupt(core, v_uart2_tx);
            return 1;
        }

