Kinin-Code-Offical/robotwin-studio/NativeEngine/src/MCU/ATmega328P_ISA.c
        uint8_t ucsr3a = AVR_IoRead(core, AVR_UCSR3A);
        uint8_t ucsr3b = AVR_IoRead(core, AVR_UCSR3B);
        if ((ucsr3a & (1u << 7)) && (ucsr3b & (1u << 7)))
        {
            AVR_EnterInterrupt(core, v_uart3_rx);
            return 1;
        }
        if ((ucsr3a & (1u << 5)) && (ucsr3b & (1u << 5)))
        {
            AVR_EnterInterrupt(core, v_uart3_udre);
            return 1;
        }
        if ((ucsr3a & (1u << 6)) && (ucsr3b & (1u << 6)))
        {
            ucsr3a = (uint8_t)(ucsr3a & ~(1u << 6));
            AVR_IoWrite(core, AVR_UCSR3A, ucsr3a);
            AVR_EnterInterrupt(core, v_uart3_tx);
            return 1;
        }
    }

    uint8_t adcsra = AVR_IoRead(core, AVR_ADCSRA);
    if ((adcsra & (1u << 4)) && (adcsra & (1u << 3)))
    {
        adcsra = (uint8_t)(adcsra & ~(1u << 4));
        AVR_IoWrite(core, AVR_ADCSRA, adcsra);
        AVR_EnterInterrupt(core, v_adc);
        return 1;
    }

    uint8_t spcr = AVR_IoRead(core, AVR_SPCR);
    uint8_t spsr = AVR_IoRead(core, AVR_SPSR);
    if ((spcr & (1u << 7)) && (spsr & (1u << 7)))
    {
        spsr = (uint8_t)(spsr & ~(1u << 7));
        AVR_IoWrite(core, AVR_SPSR, spsr);
        AVR_EnterInterrupt(core, v_spi);
        return 1;
    }

    uint8_t twcr = AVR_IoRead(core, AVR_TWCR);
    if ((twcr & (1u << 0)) && (twcr & (1u << 7)))
    {
        twcr = (uint8_t)(twcr & ~(1u << 7));
        AVR_IoWrite(core, AVR_TWCR, twcr);
        AVR_EnterInterrupt(core, v_twi);
        return 1;
    }

    uint8_t wdtcsr = AVR_IoRead(core, AVR_WDTCSR);
    if ((wdtcsr & (1u << 6)) && (wdtcsr & (1u << 7)))
    {
        wdtcsr = (uint8_t)(wdtcsr & ~(1u << 7));
        AVR_IoWrite(core, AVR_WDTCSR, wdtcsr);
        AVR_EnterInterrupt(core, v_wdt);
        return 1;
    }

    return 0;
}

uint8_t AVR_ExecuteNext(AvrCore* core)
{
    if (AVR_CheckInterrupts(core))
    {
        return 4;
    }
    uint16_t opcode = AVR_FetchWord(core);
    if (opcode == 0x0000)
    {
        return 1;
    }
    if ((opcode & 0xF000) == 0xE000)
    {
        uint8_t d = (uint8_t)(16 + ((opcode >> 4) & 0x0F));
        uint8_t k = (uint8_t)((opcode & 0x0F) | ((opcode >> 4) & 0xF0));
        if (d < core->regs_size)
        {
            core->regs[d] = k;
        }
        return 1;
    }
    if ((opcode & 0xF800) == 0xB800)
    {
        uint8_t a = (uint8_t)((opcode & 0x0F) | ((opcode >> 5) & 0x30));
        uint8_t r = (uint8_t)((opcode >> 4) & 0x1F);
        if (r < core->regs_size)
        {
            AVR_IoWrite(core, (uint16_t)(AVR_IO_BASE + a), core->regs[r]);
        }
        return 1;
    }
    if ((opcode & 0xF800) == 0xB000)
    {
        uint8_t a = (uint8_t)((opcode & 0x0F) | ((opcode >> 5) & 0x30));
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        if (d < core->regs_size)
        {
            core->regs[d] = AVR_IoRead(core, (uint16_t)(AVR_IO_BASE + a));
        }
        return 1;
    }
    if ((opcode & 0xFE0F) == 0x9000)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        uint16_t addr = AVR_FetchWord(core);
        if (d < core->regs_size)
        {
            core->regs[d] = AVR_ReadData(core, addr);
        }
        return 2;
    }
    if ((opcode & 0xFE0F) == 0x9200)
    {
        uint8_t r = (uint8_t)((opcode >> 4) & 0x1F);
        uint16_t addr = AVR_FetchWord(core);
        if (r < core->regs_size)
        {
            AVR_WriteData(core, addr, core->regs[r]);
        }
        return 2;
    }
    if ((opcode & 0xFC00) == 0x2C00)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        uint8_t r = (uint8_t)((opcode & 0x0F) | ((opcode >> 5) & 0x10));
        if (d < core->regs_size && r < core->regs_size)
        {
            core->regs[d] = core->regs[r];
        }
        return 1;
    }
    if ((opcode & 0xFF00) == 0x0100)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x0F);
        uint8_t r = (uint8_t)(opcode & 0x0F);
        uint8_t dIndex = (uint8_t)(d * 2);
        uint8_t rIndex = (uint8_t)(r * 2);
        if (dIndex + 1 < core->regs_size && rIndex + 1 < core->regs_size)
        {
            core->regs[dIndex] = core->regs[rIndex];
            core->regs[dIndex + 1] = core->regs[rIndex + 1];
        }
        return 1;
    }
    if ((opcode & 0xFC00) == 0x2400)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        uint8_t r = (uint8_t)((opcode & 0x0F) | ((opcode >> 5) & 0x10));
        if (d < core->regs_size && r < core->regs_size)
        {
            uint8_t value = (uint8_t)(core->regs[d] ^ core->regs[r]);
            core->regs[d] = value;
            core->zero_flag = (uint8_t)(value == 0);
        }
        return 1;
    }
    if ((opcode & 0xF000) == 0x7000)
    {
        uint8_t d = (uint8_t)(16 + ((opcode >> 4) & 0x0F));
        uint8_t k = (uint8_t)((opcode & 0x0F) | ((opcode >> 4) & 0xF0));
        if (d < core->regs_size)
        {
            uint8_t value = (uint8_t)(core->regs[d] & k);
            core->regs[d] = value;
            core->zero_flag = (uint8_t)(value == 0);
        }
        return 1;
    }
    if ((opcode & 0xF000) == 0x6000)
    {
        uint8_t d = (uint8_t)(16 + ((opcode >> 4) & 0x0F));
        uint8_t k = (uint8_t)((opcode & 0x0F) | ((opcode >> 4) & 0xF0));
        if (d < core->regs_size)
        {
            uint8_t value = (uint8_t)(core->regs[d] | k);
            core->regs[d] = value;
            core->zero_flag = (uint8_t)(value == 0);
        }
        return 1;
    }
    if ((opcode & 0xF000) == 0x5000)
    {
        uint8_t d = (uint8_t)(16 + ((opcode >> 4) & 0x0F));
        uint8_t k = (uint8_t)((opcode & 0x0F) | ((opcode >> 4) & 0xF0));
        if (d < core->regs_size)
        {
            uint16_t lhs = core->regs[d];
            uint16_t rhs = k;
            uint16_t result = (uint16_t)(lhs - rhs);
            core->regs[d] = (uint8_t)result;
            core->zero_flag = (uint8_t)((uint8_t)result == 0);
            core->carry_flag = (uint8_t)(lhs < rhs);
        }
        return 1;
    }
    if ((opcode & 0xF000) == 0x4000)
    {
        uint8_t d = (uint8_t)(16 + ((opcode >> 4) & 0x0F));
        uint8_t k = (uint8_t)((opcode & 0x0F) | ((opcode >> 4) & 0xF0));
        if (d < core->regs_size)
        {
            uint16_t lhs = core->regs[d];
            uint16_t rhs = (uint16_t)k + (core->carry_flag ? 1 : 0);
            uint16_t result = (uint16_t)(lhs - rhs);
            core->regs[d] = (uint8_t)result;
            core->zero_flag = (uint8_t)((uint8_t)result == 0);
            core->carry_flag = (uint8_t)(lhs < rhs);
        }
        return 1;
    }
    if ((opcode & 0xF000) == 0x3000)
    {
        uint8_t d = (uint8_t)(16 + ((opcode >> 4) & 0x0F));
        uint8_t k = (uint8_t)((opcode & 0x0F) | ((opcode >> 4) & 0xF0));
        if (d < core->regs_size)
        {
            uint16_t lhs = core->regs[d];
            uint16_t rhs = k;
            uint16_t result = (uint16_t)(lhs - rhs);
            core->zero_flag = (uint8_t)((uint8_t)result == 0);
            core->carry_flag = (uint8_t)(lhs < rhs);
        }
        return 1;
    }
    if ((opcode & 0xFC00) == 0x1400)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        uint8_t r = (uint8_t)((opcode & 0x0F) | ((opcode >> 5) & 0x10));
        if (d < core->regs_size && r < core->regs_size)
        {
            uint16_t lhs = core->regs[d];
            uint16_t rhs = core->regs[r];
            uint16_t result = (uint16_t)(lhs - rhs);
            core->zero_flag = (uint8_t)((uint8_t)result == 0);
            core->carry_flag = (uint8_t)(lhs < rhs);
        }
        return 1;
    }
    if ((opcode & 0xFC00) == 0x0C00)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        uint8_t r = (uint8_t)((opcode & 0x0F) | ((opcode >> 5) & 0x10));
        if (d < core->regs_size && r < core->regs_size)
        {
            uint16_t sum = (uint16_t)core->regs[d] + (uint16_t)core->regs[r];
            core->regs[d] = (uint8_t)sum;
            core->zero_flag = (uint8_t)((uint8_t)sum == 0);
            core->carry_flag = (uint8_t)(sum > 0xFF);
        }
        return 1;
    }
    if ((opcode & 0xFC00) == 0x1C00)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        uint8_t r = (uint8_t)((opcode & 0x0F) | ((opcode >> 5) & 0x10));
        if (d < core->regs_size && r < core->regs_size)
        {
            uint16_t sum = (uint16_t)core->regs[d] + (uint16_t)core->regs[r] + (core->carry_flag ? 1 : 0);
            core->regs[d] = (uint8_t)sum;
            core->zero_flag = (uint8_t)((uint8_t)sum == 0);
            core->carry_flag = (uint8_t)(sum > 0xFF);
        }
        return 1;
    }
    if ((opcode & 0xFF00) == 0x9A00)
    {
        uint8_t a = (uint8_t)((opcode >> 3) & 0x1F);
        uint8_t b = (uint8_t)(opcode & 0x07);
        AVR_IoSetBit(core, (uint16_t)(AVR_IO_BASE + a), b, 1);
        return 2;
    }
    if ((opcode & 0xFF00) == 0x9800)
    {
        uint8_t a = (uint8_t)((opcode >> 3) & 0x1F);
        uint8_t b = (uint8_t)(opcode & 0x07);
        AVR_IoSetBit(core, (uint16_t)(AVR_IO_BASE + a), b, 0);
        return 2;
    }
    if ((opcode & 0xFE0F) == 0x940A)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        if (d < core->regs_size)
        {
            uint8_t value = (uint8_t)(core->regs[d] - 1);
            core->regs[d] = value;
            core->zero_flag = (uint8_t)(value == 0);
        }
        return 1;
    }
    if ((opcode & 0xFE0F) == 0x920F)
    {
        uint8_t r = (uint8_t)((opcode >> 4) & 0x1F);
        if (r < core->regs_size)
        {
            AVR_Push(core, core->regs[r]);
        }
        return 2;
    }
    if ((opcode & 0xFE0F) == 0x900F)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x1F);
        if (d < core->regs_size)
        {
            core->regs[d] = AVR_Pop(core);
        }
        return 2;
    }
    if ((opcode & 0xF000) == 0xD000)
    {
        int16_t k = (int16_t)(opcode & 0x0FFF);
        if (k & 0x0800)
        {
            k = (int16_t)(k | 0xF000);
        }
        uint16_t returnAddr = core->pc;
        AVR_Push(core, (uint8_t)(returnAddr & 0xFF));
        AVR_Push(core, (uint8_t)((returnAddr >> 8) & 0xFF));
        core->pc = (uint16_t)(core->pc + k);
        return 3;
    }
    if ((opcode & 0xFE0E) == 0x940E)
    {
        uint16_t addr = AVR_FetchWord(core);
        uint16_t returnAddr = core->pc;
        AVR_Push(core, (uint8_t)(returnAddr & 0xFF));
        AVR_Push(core, (uint8_t)((returnAddr >> 8) & 0xFF));
        core->pc = addr;
        return 4;
    }
    if (opcode == 0x9508)
    {
        uint8_t high = AVR_Pop(core);
        uint8_t low = AVR_Pop(core);
        core->pc = (uint16_t)(low | (high << 8));
        return 4;
    }
    if (opcode == 0x9518)
    {
        uint8_t high = AVR_Pop(core);
        uint8_t low = AVR_Pop(core);
        core->pc = (uint16_t)(low | (high << 8));
        uint8_t sreg = AVR_IoRead(core, AVR_SREG);
        sreg = (uint8_t)(sreg | (1u << 7));
        AVR_IoWrite(core, AVR_SREG, sreg);
        return 4;
    }
    if (opcode == 0x9478)
    {
        uint8_t sreg = AVR_IoRead(core, AVR_SREG);
        sreg = (uint8_t)(sreg | (1u << 7));
        AVR_IoWrite(core, AVR_SREG, sreg);
        return 1;
    }
    if (opcode == 0x94F8)
    {
        uint8_t sreg = AVR_IoRead(core, AVR_SREG);
        sreg = (uint8_t)(sreg & ~(1u << 7));
        AVR_IoWrite(core, AVR_SREG, sreg);
        return 1;
    }
    if ((opcode & 0xFF00) == 0x9600)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x03);
        uint8_t k = (uint8_t)((opcode & 0x0F) | ((opcode >> 2) & 0x30));
        uint8_t index = (uint8_t)(24 + (d * 2));
        uint16_t value = AVR_GetRegWord(core, index);
        value = (uint16_t)(value + k);
        AVR_SetRegWord(core, index, value);
        core->zero_flag = (uint8_t)(value == 0);
        return 2;
    }
    if ((opcode & 0xFF00) == 0x9700)
    {
        uint8_t d = (uint8_t)((opcode >> 4) & 0x03);
        uint8_t k = (uint8_t)((opcode & 0x0F) | ((opcode >> 2) & 0x30));
        uint8_t index = (uint8_t)(24 + (d * 2));
        uint16_t value = AVR_GetRegWord(core, index);
        value = (uint16_t)(value - k);
        AVR_SetRegWord(core, index, value);
        core->zero_flag = (uint8_t)(value == 0);
        return 2;
    }
    if ((opcode & 0xFC07) == 0xF401)
    {
        int8_t k = (int8_t)((opcode >> 3) & 0x7F);
        if (k & 0x40)
        {
            k = (int8_t)(k | 0x80);
        }
        if (!core->zero_flag)
        {
            core->pc = (uint16_t)(core->pc + k);
            return 2;
        }
        return 1;
    }
    if ((opcode & 0xFC07) == 0xF001)
    {
        int8_t k = (int8_t)((opcode >> 3) & 0x7F);
        if (k & 0x40)
        {
            k = (int8_t)(k | 0x80);
        }
        if (core->zero_flag)
        {
            core->pc = (uint16_t)(core->pc + k);
            return 2;
        }
        return 1;
    }
    if ((opcode & 0xF000) == 0xC000)
    {
        int16_t k = (int16_t)(opcode & 0x0FFF);
        if (k & 0x0800)
        {
            k = (int16_t)(k | 0xF000);
        }
        core->pc = (uint16_t)(core->pc + k);
        return 2;
    }
    return 1;
}
